readme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="ja" xml:lang="ja">
<head>
<title>Yet another Javascript compiler Macascript</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-04-27 11:44:11 JST"/>
<meta name="author" content="浅井　政太郎 (Masataro Asai from Univ. of Tokyo)"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="readme.css" />

</head>
<body>
<div id="content">

<h1 class="title">Yet another Javascript compiler Macascript</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Yet another Javascript compiler Macascript </a></li>
<li><a href="#sec-2">2 Extend the syntax &ndash; the algorythm of  macascript </a></li>
<li><a href="#sec-3">3 How to try </a>
<ul>
<li><a href="#sec-3-1">3.1 recommended software </a></li>
<li><a href="#sec-3-2">3.2 run </a></li>
</ul>
</li>
<li><a href="#sec-4">4 Examples </a>
<ul>
<li><a href="#sec-4-1">4.1 Fundamentals </a></li>
<li><a href="#sec-4-2">4.2 Assignments </a></li>
<li><a href="#sec-4-3">4.3 Operaters </a></li>
<li><a href="#sec-4-4">4.4 Procedure/Inline/Inherit-this function </a></li>
<li><a href="#sec-4-5">4.5 Call/cc </a></li>
<li><a href="#sec-4-6">4.6 other supported syntaxes </a></li>
<li><a href="#sec-4-7">4.7 Using defmaca to define a new syntax </a></li>
</ul>
</li>
<li><a href="#sec-5">5 Motivation </a></li>
<li><a href="#sec-6">6 license </a></li>
<li><a href="#sec-7">7 Author </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Yet another Javascript compiler Macascript </h2>
<div class="outline-text-2" id="text-1">


<p>
Macascript is a simple javascript compiler which is inspired
by parenscript and coffeescript.
</p>
<p>
I wasn't satisfied with either of them, so I made one myself.
</p>
<p>
Macascript supports :
</p><ul>
<li>Conditional statements which returns a value
</li>
<li>Postfix if/unless
</li>
<li>Iteration with automatically collecting results if necessary
</li>
<li>Implicit return
</li>
<li>Call/cc (not fully functional, it's valid only when it is in the
  middle of a function call. Use try/catch for <i>global exti</i>.)
</li>
<li>Lisp Macro
</li>
<li>etc&hellip;
</li>
</ul>


<p>
Because macascript is aimed to be in fairly good accordance with Lisp
and Macro, extending its syntax is far more easier than the other
languages.  Some feature like &amp;rest or &amp;optional
(which are already suppoerted in coffeescript) are soon to be
implemented.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Extend the syntax &ndash; the algorythm of  macascript </h2>
<div class="outline-text-2" id="text-2">


<p>
The macascript source code is simple because it uses pattern
matching to parse the syntax tree.
</p>
<p>
DEFMACA macro expands the syntax tree. (currently all syntaxes are
implemented with DEFMACA.) The tree is compiled into 'compiled' special
operator, which tells the compiler that the particular expression need
not be compiled anymore. Finally, the compiled s-expression tree will
be passed to a function `maca-format', which flattens the tree and
prints its components. DEFMACA is almost identical to
defmacro, so the people who knows macro would feel it really
easy and fun to use.
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> How to try </h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> recommended software </h3>
<div class="outline-text-3" id="text-3-1">

<ul>
<li><a href="http://www.sbcl.org/">sbcl</a> : The only lisp implimentation I've tested.
</li>
<li><a href="http://www.quicklisp.org/">quicklisp</a> : great software.
</li>
<li><a href="http://common-lisp.net/project/slime/">slime</a> : I greatly recommend you to install it if you are using
  emacs. I'm an emacs user and don't know well about vim, so if you
  have any information about a good interactive interface from vim to
  lisp please tell me about it.
</li>
<li>packages : install them via quicklisp.
<ul>
<li>cl-match
</li>
<li>alexandria
</li>
<li>anaphora : I don't use it so much, but it's sometimes useful.
</li>
<li>cl-ppcre
</li>
</ul>

</li>
</ul>


</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> run </h3>
<div class="outline-text-3" id="text-3-2">

<p>Macascript is just an experimental code.
so open the REPL in the repository and input these code to the interpreter: 
</p>
<ul>
<li>if your implementation supports 'require:
<ul>
<li>(require 'macascript)
</li>
<li>(in-package :maca)
</li>
<li>(recompile)
</li>
</ul>

</li>
<li>or else:
<ul>
<li>(asdf:operate 'asdf:load-op 'macascript)
</li>
<li>(in-package :maca)
</li>
<li>(recompile)
</li>
</ul>

</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Examples </h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Fundamentals </h3>
<div class="outline-text-3" id="text-4-1">





<pre class="example">(defun fundamentals ()
  ;; fundamentals
  (maca (glue a 2 space "string")
                (paren a)
                (paren (paren a))                       ;reduces redundancy automatically
                (paren (paren (paren a)))                       ;reduces redundancy automatically
                (comma (comma a b c) (comma a b c))
                (comma a b c)
                (stringify a)
                (blk ((a b c)))
                (blk 
                 ((blk 
                   ((a b c)))))
                (bracket a)
                ;; constants and basic assignments
                undefined
                t
                "string"
                ;; comments (if you want to include some comment into js)
                (// "haaa~~~~ this is comfortable")
                (// a)))

</pre>





<pre class="example">MACA&gt; (fundamentals)

a2 "string";
(a);
((a));
(((a)));
a,b,c,a,b,c;
a,b,c;
'a';
{ /* indentation level: 0 */
        a(b,c);
}
;
{ /* indentation level: 0 */
        { /* indentation level: 1 */
                a(b,c);
        }
        ;
}
;
[a];
undefined;
true;
"string";
 /* haaa~~~~ this is comfortable */;
 /* A */;

</pre>





</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Assignments </h3>
<div class="outline-text-3" id="text-4-2">





<pre class="example">(defun assignments ()
  ;; assignments
  (maca (= number 3)
                (blk ((= number 3) (= number 3)))
                (with-label (label) 
                  (= number 3)
                  (= number 3))
                (comma (= number 3) (= number 3)))
  (maca (var number 3))
  (maca (var number))
  ;;(maca (var (+ 2 1) 3)) ;throws error
  )

</pre>





<pre class="example">MACA&gt; (assignments)

number = 3;
{ /* indentation level: 0 */
        number = 3;
        number = 3;
}
;
label:{ /* indentation level: 0 */
        number = 3;
        number = 3;
}
;
number = 3,number = 3;

var number;
number = 3;

var number;

</pre>




</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Operaters </h3>
<div class="outline-text-3" id="text-4-3">





<pre class="example">(defun ops ()
  ;; infix
  (maca (&gt;&gt;&gt; number 3)
                (+ a 3)
                (+ a 3 4)
                (- a 3 4)
                (* a 3 4)
                (+ a 3 (&gt;&gt;&gt; number 3))

                ;; assignments
                (= a 3)
                (= a (a &gt; b &gt; v))
                (a &gt; b &gt; v)

                ;; comparison
                (&lt; number 50)
                (== 5 3)
                (== 5 3 4)
                (&gt;= 5 3 4)

                ;; mono-ops
                (new -number)
                (typeof 5)

                ;; in
                (in 5 array)))

</pre>





<pre class="example">MACA&gt; (ops)

(number &gt;&gt;&gt; 3);
(a + 3);
(a + (3 + 4));
(a NIL (3 NIL 4));
(a * (3 * 4));
(a + (3 + (number &gt;&gt;&gt; 3)));
a = 3;
a = a.b.v;
a.b.v;
(number&lt;50);
(5==3);
(5==3)&amp;&amp;(3==4);
(5&gt;=3)&amp;&amp;(3&gt;=4);
(new Number);
(typeof 5);
(5 in array);

</pre>





</div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Procedure/Inline/Inherit-this function </h3>
<div class="outline-text-3" id="text-4-4">





<pre class="example">(defun functions ()
  ;; global scope(bare)
  (maca (a b c)
                (= d (- a b c))
                (var e 2)
                (+ a b c d e))

  ;; function definition
  ;; normal function: implicit return on
  ;; procedure function: returns undefined
  (maca (-/&gt; (a)
                         (alert a)
                         (-&gt; (b)
                                 (if (&lt; b 3)
                                         ((var a (- 3 b))
                                          (= b (expr a 5)))
                                         ((var a (- b 3))))
                                 (var c (+ a 3))
                                 (alert a b)
                                 a)))

  ;; inherit-this function: saves 'this' of the outer environment
  (maca (a &gt; (click (=/&gt; (e) 
                                                 (alert (this &gt; 2))))))

  ;; inline function: they are directly expanded into the environment

  (maca (foo)
                (bar foo)
                (-/ baz (a b) (+ (some-operation a)
                                                 (other-operation b)))
                (-/ bud (a b) (+ (sqrt a)
                                                 (expr b)))

                (= foo (baz foo bar))
                (alert (baz 1 (bud foo bar)))))

</pre>





<pre class="example">MACA&gt; (functions)

var e;
a(b,c);
d = (a NIL (b NIL c));
e = 2;
(a + (b + (c + (d + e))));

var a,c;
function(a){ /* indentation level: 0 */
        var a,c;
        alert(a);
        function(b){ /* indentation level: 1 */
                var a,c;
                if((b&lt;3)){ /* indentation level: 2 */
                        a = (3 NIL b);
                        b = expr(a,5);
                }
                else{ /* indentation level: 2 */
                        a = (b NIL 3);
                }
                c = (a + 3)alert(a,b);
                return a;
        }
        ;
}
;

var this3226,inheritedFn3227;
this3226 = this;
inheritedFn3227 = function(e){ /* indentation level: 0 */
        alert(this3226[1]);
}
;
a.click(inheritedFn3263);

var inlineTmp3266,inlineTmp3267,setterTemp3265,inlineTmp3283,inlineTmp3284,inlineTmp3286,inlineTmp3287,setterTemp3285,inlineTmp3303,inlineTmp3304,setterTemp3302,argName3282;
foo();
bar(foo);

inlineTmp3352 = bar;
inlineTmp3351 = foo;
setterTemp3350 = (someOperation(inlineTmp3351) + otherOperation(inlineTmp3352));
foo = setterTemp3350;


inlineTmp3438 = bar;
inlineTmp3437 = foo;
setterTemp3436 = (sqrt(inlineTmp3437) + expr(inlineTmp3438));
inlineTmp3418 = setterTemp3436;
inlineTmp3417 = 1;
argName3416 = (someOperation(inlineTmp3417) + otherOperation(inlineTmp3418));
alert(argName3416);

</pre>



</div>

</div>

<div id="outline-container-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> Call/cc </h3>
<div class="outline-text-3" id="text-4-5">





<pre class="example">(defun continuation ()
  (maca (alert
                 (with-cc (cont)
                   ($ &gt; (get "http://google.com"
                                         (-/&gt; (xhr) (cont (xhr &gt; responce-text)))))))

                (var cc1)
                (var cc2)
                (alert (with-cc (cont1) 
                                 (= cc1 cont1)
                                 (cont1 (confirm "one")))
                           2
                           (with-cc (cont2)
                                 (= cc2 cont2)
                                 (cont2 (confirm "two"))))
                (console &gt; (log (cc1 &gt; (to-string))))
                (cc1 "one-again") (// "this will call cont2 again")

                (console &gt; (log (cc2 &gt; (to-string))))
                (cc2 "two-again")

                (// "if you want to use continuation for a method, do like this:")
                (funcall (console &gt; log)
                                 (with-cc (cont1) 
                                   (= cc1 cont1)
                                   (cont1 (confirm "one")))
                                 (with-cc (cont2)
                                   (= cc2 cont2)
                                   (cont2 (confirm "two")))))

  ;; now you can use continuation with the infix operators.
  (maca (var cc)
            (alert (+ 1 (with-cc (cont)
                                          (= cc cont)
                                          (cont 2))
                                  3))
                (alert (cc 5))))

</pre>





<pre class="example">var cc1,cc2;
(function(cont){ /* indentation level: 0 */
        return $.get("http://google.com",function(xhr){ /* indentation level: 1 */
                cont(xhr.responceText);
        }
        );
}
)(function(valueArg2207){ /* indentation level: 0 */
        return alert(valueArg2207);
}
);
(function(cont2){ /* indentation level: 0 */
        cc2 = cont2;
        return cont2(confirm("two"));
}
)(function(valueArg2318){ /* indentation level: 0 */
        return (function(cont1){ /* indentation level: 0 */
        cc1 = cont1;
        return cont1(confirm("one"));
}
)(function(valueArg2331){ /* indentation level: 1 */
                return alert(valueArg2318,2,valueArg2331);
        }
        );
}
);
console.log(cc1.toString());
cc1("one-again");
 /* this will call cont2 again */;
console.log(cc2.toString());
cc2("two-again");
 /* if you want to use continuation for a method, do like this: */;
(function(cont2){ /* indentation level: 0 */
        cc2 = cont2;
        return cont2(confirm("two"));
}
)(function(valueArg2448){ /* indentation level: 0 */
        return (function(cont1){ /* indentation level: 0 */
        cc1 = cont1;
        return cont1(confirm("one"));
}
)(function(valueArg2461){ /* indentation level: 1 */
                return console.log(valueArg2448,valueArg2461);
        }
        );
}
);

var cc;
alert((function(cont){ /* indentation level: 0 */
        cc = cont;
        return cont(2);
}
)(function(valueArg2554){ /* indentation level: 0 */
        return (1 + (valueArg2554 + 3));
}
));
alert(cc(5));

</pre>




</div>

</div>

<div id="outline-container-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> other supported syntaxes </h3>
<div class="outline-text-3" id="text-4-6">


<ul>
<li>Try-Catch-Finally.
</li>
<li>Iteration. It automatically collects the value of implicit return,
  but it won't do it when it's not needed.
</li>
<li>while, do-while (which returns a value)
</li>
<li>switch, with multiple cases
</li>
</ul>


</div>

</div>

<div id="outline-container-4-7" class="outline-3">
<h3 id="sec-4-7"><span class="section-number-3">4.7</span> Using defmaca to define a new syntax </h3>
<div class="outline-text-3" id="text-4-7">


<p>
Because macascript inherited the power of Macro from Common Lisp,
macascript has its own syntax ``defmaca'' which defines a new macascript
syntax.
</p>



<pre class="example">(defmaca my-if (condition then &amp;optional else)
  `(if ,condition
       then
       else))

(maca (-&gt; (a) (my-if a true false)))


</pre>




<p>
If you really want to use the example above, you have to 
add the syntax pattern to the appropriate parameter. This will be
soon improved so that DEFMACA takes another argument for the
matching pattern and automatically add it to the list.
</p>
<p>
see test.maca for more examples.
</p>
</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Motivation </h2>
<div class="outline-text-2" id="text-5">


<p>
The motivation is that Parenscript doesn't seem to fit the need of
javascript programmers. It is rather a utility for the lisp
programmers who dynamically produces javascript code on the server
side. Parenscript is still JUST LISP while Coffeescript is trying to
follow the rule "It's just JavaScript".  The syntax was more on the
Lisp side, like loop and let. (of course you can now use 'let' in the
javascript 1.8 or newer, but it is still not available on the platform
like Titanium Mobile, which I'm currently writing js programs for.)
</p>
<p>
Besides, it often produces invalid js code. (Note that I only mention about the
old version of parenscript because I haven't been watching the project
recently.) I wanted to fix that up, but the code! Parenscript's source
code was a mess for me. I gave up.
</p>
<p>
Another motivation still. As you know, coffeescript is so cool. 
It has the better, simple and beautiful syntax.
It improved almost all of the bad points in javascript.
</p>
<p>
However IT DOESN'T HAVE MACRO!!!!! 
</p>
<p>
On the smartphone product, runtime speed is highly required for the
user experience. And js is so slow compared with Obj-C or Java, the
standard language for smartphone development. Only the compile-time
macro can handle the optimization stuff like inline function, source
code simplification, etc.
</p>
<p>
Moreover, since coffeescript TRIES TO OMIT PARENTHESES, it must use
the parser. It makes the source code complicated and
PROCEDURAL. Procedual, so its not easy to extend.
</p>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> license </h2>
<div class="outline-text-2" id="text-6">


<p>
Currently I haven't decided which license I should choose. 
I suppose MIT license best suits the condition&hellip;
</p>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Author </h2>
<div class="outline-text-2" id="text-7">


<p>
Masataro Asai (guicho2.71828@gmail.com)
Univ. of Tokyo
</p>

<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn.1" href="#fnr.1">1</a></sup> DEFINITION NOT FOUND: 2
</p>
</div>
</div>

</div>
</div>
<div id="postamble">
<p class="date">Date: 2012-04-27 11:44:11 JST</p>
<p class="author">Author: 浅井　政太郎 (Masataro Asai from Univ. of Tokyo)</p>
<p class="creator">Org version 7.6 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>
</div>
</div>
</body>
</html>
